__________________________________________________________________________________________________
Layer (type)                    Output Shape              Param #             Connected to        
==================================================================================================
input_2 (InputLayer)            (None, None, None, 1)     0                                       
__________________________________________________________________________________________________
down_level_0_no_0 (Conv2D)      (None, None, None, 32)    320                 input_2[0][0]       
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, None, 32)    128                 down_level_0_no_0[0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
down_level_0_no_1 (Conv2D)      (None, None, None, 32)    9248                activation_20[0][0] 
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, None, 32)    128                 down_level_0_no_1[0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
max_0 (MaxPooling2D)            (None, None, None, 32)    0                   activation_21[0][0] 
__________________________________________________________________________________________________
down_level_1_no_0 (Conv2D)      (None, None, None, 64)    18496               max_0[0][0]         
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, None, 64)    256                 down_level_1_no_0[0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
down_level_1_no_1 (Conv2D)      (None, None, None, 64)    36928               activation_22[0][0] 
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, None, 64)    256                 down_level_1_no_1[0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
max_1 (MaxPooling2D)            (None, None, None, 64)    0                   activation_23[0][0] 
__________________________________________________________________________________________________
down_level_2_no_0 (Conv2D)      (None, None, None, 128)   73856               max_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, None, 128)   512                 down_level_2_no_0[0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
down_level_2_no_1 (Conv2D)      (None, None, None, 128)   147584              activation_24[0][0] 
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, None, 128)   512                 down_level_2_no_1[0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
max_2 (MaxPooling2D)            (None, None, None, 128)   0                   activation_25[0][0] 
__________________________________________________________________________________________________
down_level_3_no_0 (Conv2D)      (None, None, None, 256)   295168              max_2[0][0]         
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, None, 256)   1024                down_level_3_no_0[0]
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
down_level_3_no_1 (Conv2D)      (None, None, None, 256)   590080              activation_26[0][0] 
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, None, 256)   1024                down_level_3_no_1[0]
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
max_3 (MaxPooling2D)            (None, None, None, 256)   0                   activation_27[0][0] 
__________________________________________________________________________________________________
middle_0 (Conv2D)               (None, None, None, 512)   1180160             max_3[0][0]         
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, None, 512)   2048                middle_0[0][0]      
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, None, 512)   0                   batch_normalization_
__________________________________________________________________________________________________
middle_2 (Conv2D)               (None, None, None, 256)   1179904             activation_28[0][0] 
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, None, 256)   1024                middle_2[0][0]      
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, None, None, 256)   0                   activation_29[0][0] 
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, None, None, 512)   0                   up_sampling2d_5[0][0
                                                                              activation_27[0][0] 
__________________________________________________________________________________________________
up_level_3_no_0 (Conv2D)        (None, None, None, 256)   1179904             concatenate_5[0][0] 
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, None, 256)   1024                up_level_3_no_0[0][0
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
up_level_3_no_2 (Conv2D)        (None, None, None, 128)   295040              activation_30[0][0] 
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, None, 128)   512                 up_level_3_no_2[0][0
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, None, None, 128)   0                   activation_31[0][0] 
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, None, None, 256)   0                   up_sampling2d_6[0][0
                                                                              activation_25[0][0] 
__________________________________________________________________________________________________
up_level_2_no_0 (Conv2D)        (None, None, None, 128)   295040              concatenate_6[0][0] 
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, None, 128)   512                 up_level_2_no_0[0][0
__________________________________________________________________________________________________
activation_32 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
up_level_2_no_2 (Conv2D)        (None, None, None, 64)    73792               activation_32[0][0] 
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, None, 64)    256                 up_level_2_no_2[0][0
__________________________________________________________________________________________________
activation_33 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, None, None, 64)    0                   activation_33[0][0] 
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, None, None, 128)   0                   up_sampling2d_7[0][0
                                                                              activation_23[0][0] 
__________________________________________________________________________________________________
up_level_1_no_0 (Conv2D)        (None, None, None, 64)    73792               concatenate_7[0][0] 
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, None, None, 64)    256                 up_level_1_no_0[0][0
__________________________________________________________________________________________________
activation_34 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
up_level_1_no_2 (Conv2D)        (None, None, None, 32)    18464               activation_34[0][0] 
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, None, None, 32)    128                 up_level_1_no_2[0][0
__________________________________________________________________________________________________
activation_35 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, None, None, 32)    0                   activation_35[0][0] 
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, None, None, 64)    0                   up_sampling2d_8[0][0
                                                                              activation_21[0][0] 
__________________________________________________________________________________________________
up_level_0_no_0 (Conv2D)        (None, None, None, 32)    18464               concatenate_8[0][0] 
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, None, None, 32)    128                 up_level_0_no_0[0][0
__________________________________________________________________________________________________
activation_36 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
up_level_0_no_2 (Conv2D)        (None, None, None, 32)    9248                activation_36[0][0] 
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, None, None, 32)    128                 up_level_0_no_2[0][0
__________________________________________________________________________________________________
activation_37 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 11)    363                 activation_37[0][0] 
__________________________________________________________________________________________________
activation_38 (Activation)      (None, None, None, 11)    0                   conv2d_2[0][0]      
==================================================================================================
Total params: 5,505,707
Trainable params: 5,500,779
Non-trainable params: 4,928
__________________________________________________________________________________________________
