__________________________________________________________________________________________________
Layer (type)                    Output Shape              Param #             Connected to        
==================================================================================================
input_1 (InputLayer)            (None, None, None, 1)     0                                       
__________________________________________________________________________________________________
down_level_0_no_0 (Conv2D)      (None, None, None, 32)    320                 input_1[0][0]       
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, 32)    128                 down_level_0_no_0[0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
down_level_0_no_1 (Conv2D)      (None, None, None, 32)    9248                activation_1[0][0]  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, None, 32)    128                 down_level_0_no_1[0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
max_0 (MaxPooling2D)            (None, None, None, 32)    0                   activation_2[0][0]  
__________________________________________________________________________________________________
down_level_1_no_0 (Conv2D)      (None, None, None, 64)    18496               max_0[0][0]         
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, None, 64)    256                 down_level_1_no_0[0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
down_level_1_no_1 (Conv2D)      (None, None, None, 64)    36928               activation_3[0][0]  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, None, 64)    256                 down_level_1_no_1[0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
max_1 (MaxPooling2D)            (None, None, None, 64)    0                   activation_4[0][0]  
__________________________________________________________________________________________________
down_level_2_no_0 (Conv2D)      (None, None, None, 128)   73856               max_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, None, 128)   512                 down_level_2_no_0[0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
down_level_2_no_1 (Conv2D)      (None, None, None, 128)   147584              activation_5[0][0]  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, None, 128)   512                 down_level_2_no_1[0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
max_2 (MaxPooling2D)            (None, None, None, 128)   0                   activation_6[0][0]  
__________________________________________________________________________________________________
down_level_3_no_0 (Conv2D)      (None, None, None, 256)   295168              max_2[0][0]         
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, None, 256)   1024                down_level_3_no_0[0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
down_level_3_no_1 (Conv2D)      (None, None, None, 256)   590080              activation_7[0][0]  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, None, 256)   1024                down_level_3_no_1[0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
max_3 (MaxPooling2D)            (None, None, None, 256)   0                   activation_8[0][0]  
__________________________________________________________________________________________________
middle_0 (Conv2D)               (None, None, None, 512)   1180160             max_3[0][0]         
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, None, 512)   2048                middle_0[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, None, 512)   0                   batch_normalization_
__________________________________________________________________________________________________
middle_2 (Conv2D)               (None, None, None, 256)   1179904             activation_9[0][0]  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, None, 256)   1024                middle_2[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, None, None, 256)   0                   activation_10[0][0] 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 512)   0                   up_sampling2d_1[0][0
                                                                              activation_8[0][0]  
__________________________________________________________________________________________________
up_level_3_no_0 (Conv2D)        (None, None, None, 256)   1179904             concatenate_1[0][0] 
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, None, 256)   1024                up_level_3_no_0[0][0
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, None, 256)   0                   batch_normalization_
__________________________________________________________________________________________________
up_level_3_no_2 (Conv2D)        (None, None, None, 128)   295040              activation_11[0][0] 
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, None, 128)   512                 up_level_3_no_2[0][0
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, None, None, 128)   0                   activation_12[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 256)   0                   up_sampling2d_2[0][0
                                                                              activation_6[0][0]  
__________________________________________________________________________________________________
up_level_2_no_0 (Conv2D)        (None, None, None, 128)   295040              concatenate_2[0][0] 
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, None, 128)   512                 up_level_2_no_0[0][0
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, None, 128)   0                   batch_normalization_
__________________________________________________________________________________________________
up_level_2_no_2 (Conv2D)        (None, None, None, 64)    73792               activation_13[0][0] 
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, None, 64)    256                 up_level_2_no_2[0][0
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, None, None, 64)    0                   activation_14[0][0] 
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 128)   0                   up_sampling2d_3[0][0
                                                                              activation_4[0][0]  
__________________________________________________________________________________________________
up_level_1_no_0 (Conv2D)        (None, None, None, 64)    73792               concatenate_3[0][0] 
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, None, 64)    256                 up_level_1_no_0[0][0
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, None, 64)    0                   batch_normalization_
__________________________________________________________________________________________________
up_level_1_no_2 (Conv2D)        (None, None, None, 32)    18464               activation_15[0][0] 
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, None, 32)    128                 up_level_1_no_2[0][0
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, None, None, 32)    0                   activation_16[0][0] 
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, None, None, 64)    0                   up_sampling2d_4[0][0
                                                                              activation_2[0][0]  
__________________________________________________________________________________________________
up_level_0_no_0 (Conv2D)        (None, None, None, 32)    18464               concatenate_4[0][0] 
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, None, 32)    128                 up_level_0_no_0[0][0
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
up_level_0_no_2 (Conv2D)        (None, None, None, 32)    9248                activation_17[0][0] 
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, None, 32)    128                 up_level_0_no_2[0][0
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, None, 32)    0                   batch_normalization_
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 11)    363                 activation_18[0][0] 
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, None, 11)    0                   conv2d_1[0][0]      
==================================================================================================
Total params: 5,505,707
Trainable params: 5,500,779
Non-trainable params: 4,928
__________________________________________________________________________________________________
